import Image from "next/image";
import Link from "next/link";
import Sliderbox from "@/components/slider/Sliderbox";
import Services from "@/components/services/services";
import Blogcar from "@/components/carousel/blogcar";
import Videocar from "@/components/carousel/videocar";
import Header from "@/components/Partials/Header";
import Reserveup from "@/components/Partials/reservup";
import Emergency from "@/components/Partials/emergency";


const lastpost = async () => {
  const posts = await fetch("https://api.webofen.com/api/getlastpost/6/blog", { cache: "no-store" });
  return posts.json();
};

export default async function Home() {
  const posts = await lastpost();

  return (
    <main className="min-h-screen bg-gradient-to-br from-indigo-50 via-white to-purple-50">
<div>salam</div>
      <div className="flex flex-wrap container mx-auto md:py-8 md:px-48 lg:px-48 z-0 relative">
        <div className="md:w-2/3 bg-white w-full rounded-lg  transition-all duration-300 ">
          <Header />
          <div className="container overflow-hidden p-4">
            <Sliderbox />
          </div>
          <Services />
          <div className="container mt-8 mb-14 px-4 md:px-6">
            <div className="flex items-center mb-4">
              <div className="w-1 h-6 bg-blue-600 rounded-full ml-2 mr-3"></div>
              <h2 className="text-2xl font-bold text-gray-800">داستان ما</h2>
            </div>
            <div className="container bg-blue-50 rounded-lg p-6 mb-6">
              <p className="text-gray-700 leading-relaxed">
                وبوفن یک فروشگاه ماژولار خدمات سئو است که مطابق با نیاز مشتریان پکیج های مفیدی را برای بهینه سازی به شما معرفی می کند. این سامانه به صاحبان کسب و کار قدرت انتخاب می دهد تا مسیر رشد و پیشرفت خودشان را مدیریت کنند و با دریافت مشاوره از تیم ما بهترین گزینه را برای رسیدن به اهداف خودشان انتخاب کنند. اما چرا وبوفن؟!
              </p>
            </div>
            {/*path section*/}
            <div className="py-16 pb-32">
              <div>
                <h2 className="text-2xl font-bold text-[#13274F] text-center mb-20">فرآیند سئو در مسیر وبوفن</h2>
                <div className="relative">
                  <div className="absolute top-0 bottom-0 left-1/2 transform -translate-x-1/2 w-1 bg-[#df6823] z-0"></div>
                  <div className="space-y-16">
                    {/* Step 1 */}
                    <div className="relative flex items-center justify-between">
                      <div className="w-5/12 left-timeline">
                        <div className="p-6 bg-white rounded-2xl shadow-lg hover:shadow-xl transition-shadow duration-300">
                          <div className="flex items-center gap-4 mb-4">
                            <div className="w-12 h-12 bg-[#df6823]/10 rounded-full flex items-center justify-center">
                              <span className="text-[#13274F] font-bold">
                                <svg
                                  height="30"
                                  width="30"
                                  xmlns="http://www.w3.org/2000/svg"
                                  viewBox="0 0 411.073 411.073"
                                  xmlSpace="preserve"
                                >
                                  <path style={{ fill: "#2b3237" }} d="M132.177 111.448c.083-3.764.97-7.33 2.506-10.527-.274-.017-.547-.042-.826-.042H93.93c-6.389 0-11.718 4.536-12.943 10.563l.133.005h51.057v.001z" />
                                  <path style={{ fill: "#d43d21" }} d="M132.162 112.026c0-.194.01-.386.015-.579H81.12l-.133-.005c-1.894-.075-25.869-.675-36.46 16.016-11.031 17.383-13.982 31.185-30.508 56.693C1.595 202.822.372 211.473.372 222.639.372 233.806 0 241.56 0 261.84s12.671 28.388 30.717 28.388H47.5c.536-21.18 17.858-38.187 39.167-38.187s38.632 17.007 39.168 38.187h6.327V112.026zm-14.697 97.861-70.486-.228c-5.848-.019-12.839-6.836-7.526-18.536 7.135-14.435 15.421-30.115 18.988-35.737 6.283-9.901 20.846-9.12 20.846-9.12h38.422l-.244 63.621z" />
                                  <path style={{ fill: "#1b2327" }} d="M86.667 251.734c-21.476 0-38.935 17.14-39.474 38.486-.008.338-.026.674-.026 1.014 0 21.816 17.684 39.5 39.5 39.5s39.5-17.684 39.5-39.5c0-.34-.017-.676-.025-1.014-.541-21.346-17.999-38.486-39.475-38.486zm20.997 39.5c0 11.596-9.4 20.996-20.997 20.996-11.596 0-20.997-9.4-20.997-20.996s9.401-20.997 20.997-20.997c11.597 0 20.997 9.401 20.997 20.997z" />
                                  <circle style={{ fill: "#2b3237" }} cx="86.667" cy="291.234" r="21.5" />
                                  <path style={{ fill: "#fff" }} d="M58.441 155.385c-3.567 5.622-11.854 21.302-18.988 35.737-5.313 11.7 1.679 18.518 7.526 18.536l70.486.228.244-63.621H79.286s-14.562-.781-20.845 9.12z" />
                                  <path style={{ fill: "#e74424" }} d="M385.404 86.356H157.832c-10.199 0-19.008 5.948-23.149 14.564-1.536 3.197-3.521 9.158-3.521 11.106v178.202l142.765.114c0-.039-.003-.076-.003-.115 0-21.646 17.546-39.193 39.193-39.193 21.646 0 39.193 17.546 39.193 39.193 0 .06-.004.118-.005.178l33.099.027c14.176 0 25.669-11.492 25.669-25.669V112.026c0-14.177-11.493-25.67-25.669-25.67zM304.7 181.355c0 5.429-4.4 9.829-9.83 9.829h-15.605v15.605c0 5.43-4.4 9.831-9.83 9.831h-6.572c-5.429 0-9.831-4.401-9.831-9.831v-15.605h-15.606c-5.426 0-9.829-4.4-9.829-9.829v-6.574c0-5.428 4.403-9.829 9.829-9.829h15.605v-15.604c0-5.43 4.402-9.83 9.831-9.83h6.572c5.43 0 9.83 4.4 9.83 9.83v15.604h15.605c5.43 0 9.83 4.401 9.83 9.829v6.574h.001z" />
                                  <path style={{ fill: "#1b2327" }} d="M313.117 250.727c-21.816 0-39.5 17.684-39.5 39.5 0 .039.003.077.003.116.063 21.762 17.72 39.384 39.497 39.384 21.755 0 39.398-17.587 39.495-39.321.001-.06.005-.119.005-.179 0-21.816-17.685-39.5-39.5-39.5zm0 60.496c-11.596 0-20.997-9.4-20.997-20.996s9.401-20.997 20.997-20.997 20.997 9.401 20.997 20.997-9.401 20.996-20.997 20.996z" />
                                  <circle style={{ fill: "#2b3237" }} cx="313.117" cy="290.227" r="21.5" />
                                  <path style={{ fill: "#e74424" }} d="M120.595 89.403c0-5.007-5.158-9.065-11.521-9.065s-11.521 4.059-11.521 9.065v11.476h23.042V89.403z" />
                                  <path style={{ fill: "#f7f1e6" }} d="M294.87 164.952h-15.605v-15.604c0-5.43-4.4-9.83-9.83-9.83h-6.572c-5.429 0-9.831 4.4-9.831 9.83v15.604h-15.606c-5.426 0-9.829 4.401-9.829 9.829v6.574c0 5.429 4.403 9.829 9.829 9.829h15.605v15.605c0 5.43 4.402 9.831 9.831 9.831h6.572c5.43 0 9.83-4.401 9.83-9.831v-15.605h15.605c5.43 0 9.83-4.4 9.83-9.829v-6.574c.001-5.427-4.399-9.829-9.829-9.829z" />
                                </svg>
                              </span>
                            </div>
                            <h3 className="text-md font-bold text-[#13274F]">ویزیت وبسایت</h3>
                          </div>
                          <p className="text-gray-600">آماده سازی مشکلات و ایرادات فنی</p>
                        </div>
                      </div>
                      <div className="absolute left-1/2 transform -translate-x-1/2 w-4 h-4 bg-[#df6823] rounded-full"></div>
                      <div className="w-5/12"></div>
                    </div>
                    {/* Step 2 */}
                    <div className="relative flex items-center justify-between">
                      <div className="w-5/12"></div>
                      <div className="absolute left-1/2 transform -translate-x-1/2 w-4 h-4 bg-[#df6823] rounded-full"></div>
                      <div className="w-5/12 right-timeline">
                        <div className="p-6 bg-white rounded-2xl shadow-lg hover:shadow-xl transition-shadow duration-300">
                          <div className="flex items-center gap-4 mb-4">
                            <div className="w-12 h-12 bg-[#df6823]/10 rounded-full flex items-center justify-center">
                              <span className="text-[#13274F] font-bold">
                                <svg height="30" width="30" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 414.981 414.981" xmlSpace="preserve">
                                  <path
                                    style={{ fill: "white" }}
                                    d="M349.872 43.62h-91.011v48.117a8.993 8.993 0 0 1-8.993 8.994h-86.756a8.993 8.993 0 0 1-8.993-8.994V43.62h-89.01c-17.095 0-30.952 13.857-30.952 30.953v308.871c0 17.095 13.857 30.953 30.952 30.953h116.098v-72.305a5.91 5.91 0 0 1 5.91-5.91h42.552a5.91 5.91 0 0 1 5.91 5.91v72.305h114.293c17.095 0 30.953-13.857 30.953-30.953V74.573c.001-17.096-13.859-30.953-30.953-30.953z"
                                  />
                                  <path
                                    style={{ fill: "#81b6b2" }}
                                    d="M146.16 117.184h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.91 5.91 0 0 0-5.91-5.91zM229.668 117.184h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM313.178 117.184h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM146.16 190.403h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.91 5.91 0 0 0-5.91-5.91zM229.668 190.403h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM313.178 190.403h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM146.16 262.963h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.91 5.91 0 0 0-5.91-5.91zM229.668 262.963h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM313.178 262.963h-42.552a5.91 5.91 0 0 0-5.91 5.91v42.552a5.91 5.91 0 0 0 5.91 5.91h42.552a5.91 5.91 0 0 0 5.91-5.91v-42.552a5.908 5.908 0 0 0-5.91-5.91zM229.668 336.181h-42.552a5.91 5.91 0 0 0-5.91 5.91v72.89h54.372v-72.89a5.908 5.908 0 0 0-5.91-5.91z"
                                  />
                                  <path
                                    style={{ fill: "#e0dcd3" }}
                                    d="M163.113 100.73h86.756a8.993 8.993 0 0 0 8.993-8.994V8.994A8.993 8.993 0 0 0 249.869 0h-86.756a8.993 8.993 0 0 0-8.993 8.994v82.743a8.993 8.993 0 0 0 8.993 8.993zm19.494-82.066h13.327a3.08 3.08 0 0 1 3.08 3.08v20.903h15.031V21.744a3.08 3.08 0 0 1 3.079-3.08h13.25a3.08 3.08 0 0 1 3.08 3.08v57.244a3.08 3.08 0 0 1-3.08 3.08h-13.25a3.08 3.08 0 0 1-3.079-3.08V59.029h-15.031v19.959a3.08 3.08 0 0 1-3.08 3.08h-13.327a3.08 3.08 0 0 1-3.08-3.08V21.744a3.08 3.08 0 0 1 3.08-3.08z"
                                  />
                                  <path
                                    style={{ fill: "#e74424" }}
                                    d="M179.527 78.987a3.08 3.08 0 0 0 3.08 3.08h13.327a3.08 3.08 0 0 0 3.08-3.08V59.028h15.031v19.959a3.08 3.08 0 0 0 3.079 3.08h13.25a3.08 3.08 0 0 0 3.08-3.08V21.744a3.08 3.08 0 0 0-3.08-3.08h-13.25a3.08 3.08 0 0 0-3.079 3.08v20.903h-15.031V21.744a3.08 3.08 0 0 0-3.08-3.08h-13.327a3.08 3.08 0 0 0-3.08 3.08v57.243z"
                                  />
                                </svg>
                              </span>
                            </div>
                            <h3 className="text-md font-bold text-[#13274F]">جلسه مشاوره</h3>
                          </div>
                          <p className="text-gray-600">ارائه گزارشات کامل و تجویز نسخه</p>
                        </div>
                      </div>
                    </div>
                    {/* Step 3 */}
                    <div className="relative flex items-center justify-between">
                      <div className="w-5/12 left-timeline">
                        <div className="p-6 bg-white rounded-2xl shadow-lg hover:shadow-xl transition-shadow duration-300">
                          <div className="flex items-center gap-4 mb-4">
                            <div className="w-12 h-12 bg-[#df6823]/10 rounded-full flex items-center justify-center">
                              <span className="text-[#13274F] font-bold">
                                <svg
                                  height="30"
                                  width="30"
                                  xmlns="http://www.w3.org/2000/svg"
                                  viewBox="0 0 422.167 422.167"
                                  xmlSpace="preserve"
                                >
                                  <path
                                    style={{ fill: "#77a7a2" }}
                                    d="M412.93 116.783 305.384 9.237c-12.712-12.711-33.925-12.107-46.636.604L9.534 259.056c-12.712 12.711-12.712 33.32 0 46.032l107.545 107.545c12.712 12.712 33.321 12.712 46.032 0l249.214-249.214c12.712-12.711 13.316-33.924.605-46.636zM249.07 66.528c4.594-14.984 19.145-24.172 34.169-22.538a32.333 32.333 0 0 1 10.91 3.198c13.823 6.877 21.05 22.933 16.376 38.179-4.674 15.248-19.658 24.493-34.961 22.441a32.309 32.309 0 0 1-10.827-3.465c-13.36-7.067-20.261-22.832-15.667-37.815zm-68.258 68.258c4.594-14.984 19.145-24.172 34.169-22.538a32.336 32.336 0 0 1 10.909 3.199c13.823 6.877 21.051 22.933 16.376 38.179-4.674 15.248-19.659 24.493-34.961 22.441a32.285 32.285 0 0 1-10.827-3.466c-13.359-7.067-20.259-22.832-15.666-37.815zm-68.258 68.257c4.594-14.983 19.145-24.171 34.169-22.538a32.31 32.31 0 0 1 10.909 3.199c13.823 6.876 21.05 22.932 16.376 38.179-4.674 15.248-19.659 24.494-34.961 22.441a32.366 32.366 0 0 1-10.827-3.465c-13.358-7.067-20.259-22.832-15.666-37.816zM70.789 312.582a32.305 32.305 0 0 1-10.826-3.465c-13.359-7.067-20.26-22.832-15.667-37.815 4.594-14.984 19.145-24.172 34.169-22.538a32.333 32.333 0 0 1 10.909 3.198c13.823 6.876 21.051 22.933 16.376 38.179-4.674 15.247-19.658 24.493-34.961 22.441zm97.557 44.836c-4.675 15.247-19.659 24.493-34.961 22.44a32.297 32.297 0 0 1-10.828-3.466c-13.359-7.066-20.26-22.832-15.666-37.815 4.593-14.984 19.144-24.172 34.169-22.538a32.306 32.306 0 0 1 10.909 3.198c13.824 6.878 21.051 22.933 16.377 38.181zm68.258-68.258c-4.675 15.247-19.659 24.493-34.961 22.44a32.285 32.285 0 0 1-10.827-3.466c-13.359-7.067-20.26-22.832-15.666-37.816 4.593-14.983 19.144-24.172 34.169-22.537a32.306 32.306 0 0 1 10.909 3.197c13.823 6.879 21.05 22.935 16.376 38.182zm68.257-68.258c-4.674 15.247-19.658 24.493-34.961 22.441a32.307 32.307 0 0 1-10.827-3.466c-13.359-7.067-20.26-22.832-15.667-37.815 4.593-14.984 19.144-24.172 34.169-22.538a32.333 32.333 0 0 1 10.91 3.197c13.823 6.878 21.05 22.934 16.376 38.181zm68.258-68.258c-4.674 15.247-19.658 24.493-34.961 22.44a32.285 32.285 0 0 1-10.827-3.466c-13.359-7.066-20.26-22.832-15.667-37.815 4.594-14.984 19.144-24.172 34.169-22.538a32.306 32.306 0 0 1 10.909 3.198c13.824 6.878 21.051 22.935 16.377 38.181z"
                                  />
                                  <path
                                    style={{ fill: "#f7f1e6" }}
                                    d="M356.743 114.464 307.704 65.426c-2.478-2.479-2.478-6.5 0-8.978l20.697-20.698c2.478-2.478 6.5-2.478 8.978 0l49.039 49.039c2.478 2.478 2.478 6.5 0 8.978l-20.698 20.697c-2.478 2.478-6.5 2.478-8.977 0z"
                                  />
                                  <path
                                    style={{ fill: "#e0dcd3" }}
                                    d="M351.812 112.496 302.773 63.457a6.348 6.348 0 0 1 0-8.977l23.414-23.415a6.348 6.348 0 0 1 8.978 0l49.038 49.039a6.348 6.348 0 0 1 0 8.977l-23.414 23.415a6.351 6.351 0 0 1-8.977 0z"
                                  />
                                </svg>
                              </span>
                            </div>
                            <h3 className="text-md font-bold text-[#13274F]">خرید قرص ها</h3>
                          </div>
                          <p className="text-gray-600">تجویز شده توسط کارشناسان</p>
                        </div>
                      </div>
                      <div className="absolute left-1/2 transform -translate-x-1/2 w-4 h-4 bg-[#df6823] rounded-full"></div>
                      <div className="w-5/12"></div>
                    </div>
                    {/* Step 4 */}
                    <div className="relative flex items-center justify-between">
                      <div className="w-5/12"></div>
                      <div className="absolute left-1/2 transform -translate-x-1/2 w-4 h-4 bg-[#df6823] rounded-full"></div>
                      <div className="w-5/12 right-timeline">
                        <div className="p-6 bg-white rounded-2xl shadow-lg hover:shadow-xl transition-shadow duration-300">
                          <div className="flex items-center gap-4 mb-4">
                            <div className="w-12 h-12 bg-[#df6823]/10 rounded-full flex items-center justify-center">
                              <span className="text-[#13274F] font-bold">

                                <svg height="30" width="30" xmlns="http://www.w3.org/2000/svg" viewBox="0 0 390.158 390.158" xmlSpace="preserve">
                                  <path
                                    style={{ fill: '#2b3237' }}
                                    d="M277.164 0H113.006C97.302 0 84.612 12.732 84.612 28.421v333.342c0 15.675 12.69 28.395 28.394 28.395h164.158c15.688 0 28.381-12.72 28.381-28.395V28.421C305.545 12.732 292.852 0 277.164 0zM154.576 17.258h81.045c2.054 0 3.692 3.057 3.692 6.832 0 3.79-1.639 6.859-3.692 6.859h-81.045c-2.068 0-3.693-3.069-3.693-6.859 0-3.776 1.625-6.832 3.693-6.832zm40.53 344.851c-9.999 0-18.133-8.135-18.133-18.146 0-10.013 8.134-18.106 18.133-18.106 9.968 0 18.076 8.094 18.076 18.106.001 10.012-8.107 18.146-18.076 18.146zm89.167-62.119H105.898V47.958h178.375V299.99z"
                                  />
                                  <path style={{ fill: '#f7f1e6' }} d="M105.898 47.958h178.375V299.99H105.898z" />
                                  <path
                                    style={{ fill: '#e74424' }}
                                    d="M234.861 156.948h-21.613v-21.615c0-7.521-6.095-13.615-13.615-13.615h-9.104c-7.52 0-13.617 6.094-13.617 13.615v21.615h-21.615c-7.515 0-13.612 6.095-13.612 13.613v9.106c0 7.519 6.098 13.613 13.612 13.613h21.615v21.616c0 7.521 6.098 13.617 13.617 13.617h9.104c7.521 0 13.615-6.097 13.615-13.617V193.28h21.613c7.521 0 13.617-6.095 13.617-13.613v-9.106c.001-7.518-6.095-13.613-13.617-13.613z"
                                  />
                                  <path
                                    style={{ fill: '#e6a123' }}
                                    d="M195.109 363.286c-10.647 0-19.311-8.664-19.311-19.324 0-10.662 8.663-19.281 19.311-19.281 10.615 0 19.25 8.619 19.25 19.281 0 10.66-8.634 19.324-19.25 19.324zM154.576 17.258h81.045c2.054 0 3.692 3.057 3.692 6.832 0 3.79-1.639 6.859-3.692 6.859h-81.045c-2.068 0-3.693-3.069-3.693-6.859 0-3.776 1.625-6.832 3.693-6.832z"
                                  />
                                </svg>
                              </span>
                            </div>
                            <h3 className="text-md font-bold text-[#13274F]">مصرف به موقع</h3>
                          </div>
                          <p className="text-gray-600">قرص ها مطابق با دستور کارشناس</p>
                        </div>
                      </div>
                    </div>
                    {/* Step 5 */}
                    <div className="relative flex items-center justify-between">
                      <div className="w-5/12 left-timeline">
                        <div className="p-6 bg-white rounded-2xl shadow-lg hover:shadow-xl transition-shadow duration-300">
                          <div className="flex items-center gap-4 mb-4">
                            <div className="w-12 h-12 bg-[#df6823]/10 rounded-full flex items-center justify-center">
                              <span className="text-[#13274F] font-bold">
                                <svg
                                  height="30"
                                  width="30px"
                                  viewBox="0 0 399.971 399.971"
                                  xmlns="http://www.w3.org/2000/svg"
                                  fill="#000000">
                                  <g>
                                    <path
                                      style={{ fill: 'white' }}
                                      d="M303.065,68.767c-16.316,0-29.541-13.226-29.541-29.543V1.105l34.92,33.815L273.524,0h-73.539 H87.223C70.909,0,57.682,13.227,57.682,29.542v340.887c0,16.315,13.227,29.542,29.541,29.542h112.762h112.761 c16.315,0,29.543-13.227,29.543-29.542V68.767h-1.07H303.065z M147.598,71.483c0-5.781,4.688-10.468,10.468-10.468h16.622v-16.62 c0-5.782,4.688-10.47,10.47-10.47h0.954h6.047c5.785,0,10.472,4.688,10.472,10.47v16.621h16.62c5.783,0,10.47,4.687,10.47,10.468 v7.004c0,5.781-4.687,10.468-10.47,10.468h-16.62v16.623c0,5.783-4.687,10.471-10.472,10.471h-6.047h-0.954 c-5.781,0-10.47-4.688-10.47-10.471V88.956h-16.622c-5.78,0-10.468-4.687-10.468-10.468L147.598,71.483L147.598,71.483z M96.96,145.371c0-5.277,4.275-9.555,9.553-9.555h31.531c5.277,0,9.555,4.277,9.555,9.555v31.528 c0,5.277-4.277,9.555-9.555,9.555h-31.531c-5.277,0-9.553-4.277-9.553-9.555V145.371z M307.493,320.121H103.931 c-2.661,0-4.819-2.158-4.819-4.82s2.158-4.819,4.819-4.819h203.562c2.662,0,4.819,2.157,4.819,4.819 S310.155,320.121,307.493,320.121z M307.493,276.332H103.931c-2.661,0-4.819-2.158-4.819-4.82c0-2.661,2.158-4.819,4.819-4.819 h203.562c2.662,0,4.819,2.158,4.819,4.819C312.312,274.174,310.155,276.332,307.493,276.332z M307.493,230.43H103.931 c-2.661,0-4.819-2.157-4.819-4.819c0-2.663,2.158-4.82,4.819-4.82h203.562c2.662,0,4.819,2.157,4.819,4.82 C312.312,228.272,310.155,230.43,307.493,230.43z M307.493,184.527H163.411c-2.661,0-4.82-2.158-4.82-4.819 c0-2.662,2.159-4.821,4.82-4.821h144.082c2.662,0,4.819,2.159,4.819,4.821C312.312,182.369,310.155,184.527,307.493,184.527z"
                                    />
                                    <path
                                      style={{ fill: '#E0DCD3' }}
                                      d="M273.524,39.224c0,16.317,13.225,29.543,29.541,29.543h38.153h1.07l-33.845-33.846l-34.92-34.92 L273.524,39.224L273.524,39.224z"
                                    />
                                    <path
                                      style={{ fill: '#DEC8AE' }}
                                      d="M106.512,186.454h31.531c5.277,0,9.555-4.277,9.555-9.555v-31.528 c0-5.277-4.277-9.555-9.555-9.555h-31.531c-5.277,0-9.553,4.277-9.553,9.555v31.528 C96.96,182.177,101.235,186.454,106.512,186.454z"
                                    />
                                    <path
                                      style={{ fill: '#DEC8AE' }}
                                      d="M307.493,174.887H163.411c-2.661,0-4.82,2.159-4.82,4.821c0,2.661,2.159,4.819,4.82,4.819h144.082 c2.662,0,4.819-2.158,4.819-4.819C312.312,177.046,310.155,174.887,307.493,174.887z"
                                    />
                                    <path
                                      style={{ fill: '#DEC8AE' }}
                                      d="M307.493,220.79H103.931c-2.661,0-4.819,2.157-4.819,4.82c0,2.662,2.158,4.819,4.819,4.819 h203.562c2.662,0,4.819-2.157,4.819-4.819C312.312,222.947,310.155,220.79,307.493,220.79z"
                                    />
                                    <path
                                      style={{ fill: '#DEC8AE' }}
                                      d="M307.493,266.692H103.931c-2.661,0-4.819,2.158-4.819,4.819c0,2.662,2.158,4.82,4.819,4.82 h203.562c2.662,0,4.819-2.158,4.819-4.82C312.312,268.851,310.155,266.692,307.493,266.692z"
                                    />
                                    <path
                                      style={{ fill: '#DEC8AE' }}
                                      d="M307.493,310.481H103.931c-2.661,0-4.819,2.157-4.819,4.819s2.158,4.82,4.819,4.82h203.562 c2.662,0,4.819-2.158,4.819-4.82S310.155,310.481,307.493,310.481z"
                                    />
                                    <path
                                      style={{ fill: '#D43D21' }}
                                      d="M158.066,88.955h16.622v16.623c0,5.783,4.688,10.471,10.47,10.471h0.954h6.047 c5.785,0,10.472-4.688,10.472-10.471V88.955h16.62c5.783,0,10.47-4.687,10.47-10.468v-7.004c0-5.781-4.687-10.468-10.47-10.468 h-16.62v-16.62c0-5.782-4.687-10.47-10.472-10.47h-6.047h-0.954c-5.781,0-10.47,4.688-10.47,10.47v16.621h-16.622 c-5.78,0-10.468,4.687-10.468,10.468v7.004C147.598,84.269,152.286,88.955,158.066,88.955z"
                                    />
                                  </g>
                                </svg>
                              </span>
                            </div>
                            <h3 className="text-md font-bold text-[#13274F]">دریافت گزارش</h3>
                          </div>
                          <p className="text-gray-600">فعالیت های انجام شده در پنل کاربری</p>
                        </div>
                      </div>
                      <div className="absolute left-1/2 transform -translate-x-1/2 w-4 h-4 bg-[#df6823] rounded-full"></div>
                      <div className="w-5/12"></div>
                    </div>
                  </div>
                </div>
              </div>
            </div>
          </div>
          <div className="container mt-10">
            <span className="w-2/3 h-1 bg-black "></span>
            <div className="flex justify-between px-4 mb-6">
              <div className="flex items-center ">
                <div className="w-0.5 h-6 bg-blue-600 rounded-full mr-3 ml-2"></div>
                <h2 className="text-xl text-[#252476] ">جدیدترین مقالات</h2>
              </div>
              <a href="/blog" class="relative inline-flex items-center px-8 pr-3 overflow-hidden text-sm text-indigo-600 border-1 border-indigo-600 rounded-full hover:text-white group hover:bg-gray-50">
                <span class="absolute right-0 block w-full h-0 transition-all bg-indigo-600 opacity-100 group-hover:h-full top-1/2 group-hover:top-0 duration-400 ease"></span>

                <span class="absolute left-2 flex items-center justify-end w-6 h-6 duration-300 transform -translate-x-full group-hover:translate-x-0 ease">
                  <svg className="w-4 h-4"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 512 512"
                    xmlSpace="preserve"
                  >
                    <path
                      d="M441.751 475.584 222.166 256 441.75 36.416a21.33 21.33 0 0 0 4.629-23.253C443.094 5.184 435.286 0 426.667 0H320.001a21.24 21.24 0 0 0-15.083 6.251L70.251 240.917c-8.341 8.341-8.341 21.824 0 30.165l234.667 234.667A21.239 21.239 0 0 0 320.001 512h106.667c8.619 0 16.427-5.184 19.712-13.163a21.33 21.33 0 0 0-4.629-23.253z"
                      fill="currentColor"
                    />
                  </svg>
                </span>

                <span class="relative">مشاهده مقالات</span>
              </a>
            </div>
            <div className="container pt-12 pb-20 flex flex-wrap p-8 bg-gradient-to-b from-white from- via-red-50 via- to-white  ">
              <Blogcar posts={posts.posts} />
            </div>
          </div>
          <div className="container ">
            <div className="flex justify-between px-4 mb-6">
              <div className="flex items-center ">
                <div className="w-0.5 h-6 bg-blue-600 rounded-full mr-3 ml-2"></div>
                <h2 className="text-xl text-[#252476] ">ویدئوهای آموزشی</h2>
              </div>
              <a href="/videos" class="relative inline-flex items-center px-8 pr-3 overflow-hidden text-sm text-indigo-600 border-1 border-indigo-600 rounded-full hover:text-white group hover:bg-gray-50">
                <span class="absolute right-0 block w-full h-0 transition-all bg-indigo-600 opacity-100 group-hover:h-full top-1/2 group-hover:top-0 duration-400 ease"></span>

                <span class="absolute left-2 flex items-center justify-end w-6 h-6 duration-300 transform -translate-x-full group-hover:translate-x-0 ease">
                  <svg className="w-4 h-4"
                    xmlns="http://www.w3.org/2000/svg"
                    viewBox="0 0 512 512"
                    xmlSpace="preserve"
                  >
                    <path
                      d="M441.751 475.584 222.166 256 441.75 36.416a21.33 21.33 0 0 0 4.629-23.253C443.094 5.184 435.286 0 426.667 0H320.001a21.24 21.24 0 0 0-15.083 6.251L70.251 240.917c-8.341 8.341-8.341 21.824 0 30.165l234.667 234.667A21.239 21.239 0 0 0 320.001 512h106.667c8.619 0 16.427-5.184 19.712-13.163a21.33 21.33 0 0 0-4.629-23.253z"
                      fill="currentColor"
                    />
                  </svg>
                </span>

                <span class="relative">مشاهده ویدئو ها</span>
              </a>
            </div>
            <div className="container flex flex-wrap p-4  ">
              <Videocar />
            </div>
          </div>
          <div>

          </div>

          <Emergency />
        </div>
        <Reserveup />
      </div>
    </main>
  );
}
